[
    {
        "postedAt": "2022-04-22 01:38:31",
        "text": "anyone living in Richardson appts next year dm me and lmk @andrewkim615",
        "campus": "busch",
        "location": "Richardson Apartments",
        "coordinates": "40.52641529364161, -74.4681162931315"
    },
    {
        "postedAt": "2022-04-22 02:05:38",
        "text": "To the blonde curly hair girl inside RUHungry at 12:30 Friday the 22nd, I wanted to ask for your number but because you were in a group i didn't have the balls to ask you for it, i was the tall guy who held the door for you, if you see this hmu!!!❤",
        "campus": "collegeAve",
        "location": "RUHungry",
        "coordinates": "40.49910760803572, -74.44819048326109"
    },
    {
        "postedAt": "2022-04-22 02:13:02",
        "text": "i just met the finest brown man at pub (4/22) with a bunch of tatts his name is neel/neil he’s also a senior i was tryna get your snap but naji kicked you out please HMU thank you",
        "campus": "collegeAve",
        "location": "Blackthorn Restaurant & Irish Pub",
        "coordinates": "40.496462855763625, -74.44247375138922"
    },
    {
        "postedAt": "2022-04-22 02:23:34",
        "text": "4/22 @1:30-2:00am to the girl on the lx with the glasses on your super pretty I was too shy and a little high to not come over hmu!",
        "location": "LX Bus"
    },
    {
        "postedAt": "2022-04-22 02:31:04",
        "text": "To the people at Richardson making tie dye shirts, y’all are good vibessss drop ur @ inna comments",
        "campus": "busch",
        "location": "Richardson Apartments",
        "coordinates": "40.52641529364161, -74.4681162931315"
    },
    {
        "postedAt": "2022-04-22 02:48:51",
        "text": "To everyone in Cabaret Theatre’s production of Spring Awakening: YOU ALL ARE ABSOLUTELY INCREDIBLE AND SHOULD BE SO PROUD!!!!",
        "campus": "cookDoug",
        "location": "Cabaret Theatre",
        "coordinates": "40.48424750293101, -74.43879661246943"
    },
    {
        "postedAt": "2022-04-22 05:51:42",
        "text": "Girl with the green flannel and black hijab on the lx on 4/21 Thursday 8:30 ish. Ur friend had a halal guys bag or sum. I exchanged a few glances with you, and I’m so sorry for staring😭. If u want, maybe we could go and grab a coffee or sum after Ramadan? I was the guy in the green print button up and tan jacket. ",
        "location": "LX"
    },
    {
        "postedAt": "2022-04-22 07:13:06",
        "text": "I’m looking for a place to stay for this upcoming semester!! I’m down to have a few roommates (preferably women)  please contact me @johlie_ if you’re looking for anyone!!!"
    },
    {
        "postedAt": "2022-04-22 08:57:23",
        "text": "To the person who found and delivered my lost wallet from college ave parking deck to my house on 4/20, THANK YOU SO MUCH 🥺I was so frustrated when I lost the wallet and you made my day. It made me feel so wholesome because you must have gone out your ways to spend time and gas to just to drop off my wallet. I'm so grateful for you and your kindness and I hope you ace your finals :)",
        "campus": "collegeAve",
        "location": "College Avenue Parking Deck",
        "coordinates": "40.50446349946988, -74.45139572128204"
    },
    {
        "postedAt": "2022-04-22 09:14:54",
        "text": "to the goose that chased me yesterday on livi - I have never been chased by one of you before. but the one time I wear my rainbow jacket this is what you do. geese r homophobic confirmed 🙄 hashtag stay woke",
        "campus": "livingston",
        "location": "Lynton South Tower",
        "coordinates": "40.522982599049904, -74.43594441675226"
    },
    {
        "postedAt": "2022-04-22 09:35:46",
        "text": "To the tall white guy at Busch dining hall on 4/19 around 6ish, wearing a blue hoodie and wired apple headphones, just wanted to say you are super cute",
        "campus": "busch",
        "location": "Busch Dining Hall",
        "coordinates": "40.522548632995274, -74.45777784367293"
    },
    {
        "postedAt": "2022-04-22 10:59:43",
        "text": "Is there anyone that knows how to and can tailor my suit for gay prom? It’s like really oversized now"
    },
    {
        "postedAt": "2022-04-22 11:46:56",
        "text": "Is anyone going to the lucky daye concert this saturday, that I can go w? I don’t wanna go alone :/",
        "location": "lucky daye concert"
    },
    {
        "postedAt": "2022-04-22 11:49:11",
        "text": "To whoever was on the LX bus around 11:30AM, 4/22, if your phone name on AirDrop is お尻♡, I like your humor; let's talk!",
        "location": "LX"
    },
    {
        "postedAt": "2022-04-22 12:56:24",
        "text": "To anyone going to the engineering formal tonight (4/22) how formal is formal? Because I don’t want to embarrass myself going formal if everyone else isn’t gonna follow dress code… (plz respond)"
    },
    {
        "postedAt": "2022-04-22 13:05:52",
        "text": "4/18, to the girl on REXB at around 5:30ish wearing a red jacket and you had a tan leather bag. You got off at hill centre. I didn’t understand if you were looking at me or someone behind me. I was the guy sitting right behind the door on the elevated side. Hmu if you want to talk. PS your hair was nice..",
        "campus": "busch",
        "location": "Hill Center",
        "coordinates": "40.522107704323474, -74.4626988737795"
    },
    {
        "postedAt": "2022-04-22 13:12:19",
        "text": "4/22 : to they tall guy in the livi gym around 11:45, you were wearing a green shirt and with ur friend who was wearing a purple shirt a green hat and jeans( btw who tf wears jeans to the gym lol) but I just thought you were really attractive and u seem so chill",
        "campus": "livingston",
        "location": "Livingston Recreation Center",
        "coordinates": "40.52120495107628, -74.43089776929375"
    },
    {
        "postedAt": "2022-04-22 13:21:30",
        "text": "To the brown girl and black guy in the black Mercedes by Newell Apts around 9pm. Y’all are so cute, I just want what y’all have :/ ",
        "campus": "cookDoug",
        "location": "Newell Apartments",
        "coordinates": "40.47755161764326, -74.42986151028774"
    },
    {
        "postedAt": "2022-04-22 13:22:48",
        "text": "Does anyone have tips or resources for finding housing in nyc for the summer? It’s pretty late, but hopefully there’s still options out there and if anyone is subletting or looking for an apartment in nyc lmk! "
    },
    {
        "postedAt": "2022-04-22 13:29:28",
        "text": "(4/20) To the guy on the LX otw to livi with glasses, a light blue hoodie, and Birkenstocks. I was the guy right across from you in the green sweater. We kept meeting eyes and you’re cute so hmu if 🌈 💅  ",
        "location": "LX"
    },
    {
        "postedAt": "2022-04-22 13:49:22",
        "text": "Not a missed connection but are there any other seniors graduating next month that feel like that haven’t made a solid group of friends? Lots of acquaintances but not an actual friend group"
    },
    {
        "postedAt": "2022-04-22 14:11:50",
        "text": "To the girl in the red tesla who almost crashed into my car at livi because she didn't look both ways while making a left turn.. u cute but I need to know who you are so i can make fun of you bc that shit was funny af. I'll even throw in free driving lessons (as long as i can ride in the tesla)p.s. ask ur dad to buy you autopilot or smth 💀",
        "campus": "livingston",
        "location": "avoided crash site",
        "coordinates": "40.531556,-74.4425745"
    },
    {
        "postedAt": "2022-04-22 14:41:50",
        "text": "To the girl on a zoom call on the druskin terrace at around 2:30 on 4/21, sorry for staring you are just sooo gorgeous and your whole aura and energy was so beautiful :) ",
        "campus": "collegeAve",
        "location": "Dunkin'",
        "coordinates": "40.49417202442225, -74.44330258328698"
    },
    {
        "postedAt": "2022-04-22 14:55:56",
        "text": "To the girl in Alex lib(around 3pm) in the green flannel, blue shirt, and AirPods. I kept looking at you and you kinda caught me looking at you i think haha. You’re really cute. Would you be down to grab some food or/and coffee with me? I’d love to get to know you! plz hmu if you’re down :))",
        "campus": "collegeAve",
        "location": "Alexander Library",
        "coordinates": "40.504984460675374, -74.45257861772129"
    },
    {
        "postedAt": "2022-04-22 15:04:41",
        "text": "To the Asian guy at Livi dining hall on 4/22 around 2PM who had circle glasses, a white/beige sweater, and a sharp jawline, my friend thought you were really pretty. If you’re single, reach out to me! ",
        "campus": "livingston",
        "location": "Livingston Dining Commons",
        "coordinates": "40.522920791153126, -74.43809400760368"
    },
    {
        "postedAt": "2022-04-22 15:23:13",
        "text": "ive talked to my roommate about the issue and nothings gotten better. I just wanna sleep, why do you set alarms so early and just snooze them and they just keep going off. Even on the weekends. Like i dont get home from work until 2am and you set 5am alarms every single saturday, just to snooze them and im the one that gets woken up while you just sleep right through them. I cant take it anymore. I cant wait til the semesters over man",
        "location": "hell"
    },
    {
        "postedAt": "2022-04-22 15:52:10",
        "text": "4/22 the guy in the hot pink shirt jogging next to brower around 3:45pm you’re really cute hmu :)",
        "campus": "collegeAve",
        "location": "Brower Commons",
        "coordinates": "40.50384494152471, -74.45158949576533"
    },
    {
        "postedAt": "2022-04-22 16:10:02",
        "text": "To the girl that was wearing a purple/magenta top in the Cook Doug gym and at the leg press machine at around 5:10-5:30. I think you also had like a gold Christ necklace around your neck if I recall. Your smile is absolutely vibrant and definitely would make anyone’s day. HMU I’d love to get to know you! ",
        "campus": "cookDoug",
        "location": "Cook/Douglass Recreation Center",
        "coordinates": "40.47866740601057, -74.43266494018413"
    },
    {
        "postedAt": "2022-04-22 16:11:00",
        "text": "if anyone is selling stray kids newark nj tickets pls hmu, looking to buy up to 4 !"
    },
    {
        "postedAt": "2022-04-22 16:41:33",
        "text": "To the guys in the little white Lexus crossover pulled over by RUPD by Alexander Library around 4:15 PM on Friday, I hope y'all are good; I saw you drive off so I guess you are. ☺️ Why did they need 4 police cars for a traffic stop, seems excessive? I'm super curious/nosey lol",
        "campus": "collegeAve",
        "location": "Alexander Library",
        "coordinates": "40.50503340649442, -74.45256788733899"
    },
    {
        "postedAt": "2022-04-22 17:01:44",
        "text": "Not a missed connection but to the person who left their silver Nissan running in the parking lot behind Murray Hall around 5pm on 4/22, I hope you’re ok and didn’t just forget to turn your car off. ",
        "campus": "collegeAve",
        "location": "Murray Hall",
        "coordinates": "40.500772006107496, -74.44660549549737"
    },
    {
        "postedAt": "2022-04-22 17:34:45",
        "text": "(4/22) to the guy at the palestine rally wearing a blue thobe and i think white & blue sneakers, you were so so cute",
        "campus": "collegeAve",
        "location": "Free Palestine",
        "coordinates": "40.503836782276, -74.4515143939029"
    },
    {
        "postedAt": "2022-04-22 17:36:40",
        "text": "Yo are there any travel clubs i can join like Indian ones? Btw I am not good at dancing/singing and def don't wanna do an academic club"
    },
    {
        "postedAt": "2022-04-22 17:49:09",
        "text": "To the tan Asian guy, with a nice butt, at Easton Avenue Gym who wears blue headphones. I heard you talking to your 3 Spanish friends, I thought you were really friendly and cute. Hmu ",
        "campus": "collegeAve",
        "location": "Easton Avenue Gym",
        "coordinates": "40.49724323555293, -74.44794347497314"
    },
    {
        "postedAt": "2022-04-22 17:53:37",
        "text": "To the girl with blonde hair I talked to around 4 PM today (4/22) near the Scott hall area on the bench.  I was the guy wearing the pink polo shirt with blank pants.  We talked about you being a matketing major and how this is your last year at RU.  You were a really nice person and since this is your last year here, we may not see each other again, but just wanted to say that congrats on graduating and I wish you the best of luck on all of your future endeavors.  ",
        "campus": "collegeAve",
        "location": "Scott Hall",
        "coordinates": "40.49991651058618, -74.44754138229928"
    },
    {
        "postedAt": "2022-04-22 18:08:33",
        "text": "Not a missed connection but does anyone else feel like college so fucking lonely? I feel like I'm there just to get a degree and leave. I know that's not what it's supposed to be about but I feel like it's not gonna change. Anyone with me?",
        "location": "my feelings"
    },
    {
        "postedAt": "2022-04-22 18:26:45",
        "text": "The tall brown haired guy in the suit outside College Ave Student Center on Friday, ~5 pm,We were vibing to the band with the saxophone. I was the blonde guy wearing khaki pants. I wish I'd talked to you, but am awkward and didn't want to make you feel uncomfortable as idk if you like guys too. You're really handsome tho and I hope you have a great evening, hmu if you're interested :)",
        "campus": "collegeAve",
        "location": "College Avenue Student Center",
        "coordinates": "40.50288142637295, -74.45203002306403"
    },
    {
        "postedAt": "2022-04-22 18:32:01",
        "text": "Um so I am Indian and will be dorming next year. I am sorry for whoever is gonna be my roommate coz my mom will prolly spam u. #strictdesimoms.",
        "location": "dorm of glass"
    },
    {
        "postedAt": "2022-04-22 18:43:59",
        "text": "To the girl I met at the AEPI party who left before I could get your number… add me. I was the kid who mentioned his Nintendo switch, all the new Star Wars legos I got, and how excited I am for the new Lego Indiana Jones game",
        "location": "AEPI party"
    },
    {
        "postedAt": "2022-04-22 18:46:05",
        "text": "4/22: To the kind person who offered me chapstick at Demfest, two things.1. Thank you very much.2. You looked very beautiful",
        "campus": "collegeAve",
        "location": "Demarest Hall",
        "coordinates": "40.50357982485473, -74.45038212304684"
    },
    {
        "postedAt": "2022-04-22 19:48:48",
        "text": "Not a missed connection, but if anyones looking to sublet a room at the standard fromJune to August lmk!!!"
    },
    {
        "postedAt": "2022-04-22 19:49:36",
        "text": "to the guys who took it way too far and were screaming profanities and racist comments on Sicard today: you’re disgusting and i felt so unsafe i crossed the street and went through the parking lot to get around you. ",
        "campus": "collegeAve",
        "location": "Sicard St",
        "coordinates": "40.502496468091024, -74.45377307520917"
    },
    {
        "postedAt": "2022-04-22 21:39:55",
        "text": "(4/13) To the tall, attractive Asian boy who was wearing a green t-shirt and black pants, and walked down the back stairs of Tillet Hall around 4:15-4:30pm, I thought you were really cute. If you’re single, I would love to get to know you better. ☺️",
        "campus": "livingston",
        "location": "Tillet Hall",
        "coordinates": "40.5219585039965, -74.43602188478512"
    },
    {
        "postedAt": "2022-04-22 22:04:23",
        "text": "Does anyone feel like they have friends but all your friends have closer friends than you? It’s a weird feeling and sometimes I feel like I’m the only one putting all the effort to be friends",
        "location": "sadge motel"
    },
    {
        "postedAt": "2022-04-22 22:15:26",
        "text": "this is to the hijabis I saw comparing and checking out each other’s tits at Alexander lib: you guys made me laugh lmao ",
        "campus": "collegeAve",
        "location": "Alexander Library",
        "coordinates": "40.5050415656797, -74.4526537179753"
    },
    {
        "postedAt": "2022-04-22 22:25:11",
        "text": "How do you get over a guy who has a girlfriend? He’s literally the sweetest, cutest, and nicest person ever. Whenever I’m around him, I get all nervous and flustered, and my heart skips a beat. I do my best to keep a distance and be respectful, but holy this sucks."
    },
    {
        "postedAt": "2022-04-22 22:26:54",
        "text": "To Elizabeth our DoorDash driver on 4/22 around 9:40pm thanks for getting us chip I’d like to return the favor pls hmu "
    },
    {
        "postedAt": "2022-04-22 22:41:01",
        "text": "Where are all the Lebanese baddies at? Tryna get me a wife I can bring home?👀👀"
    },
    {
        "postedAt": "2022-04-22 23:37:54",
        "text": "It seems so many people here enjoy the pink puffball Kirby, I'd really like to be friends with any if not all of you 😊"
    },
    {
        "postedAt": "2022-04-22 23:47:56",
        "text": "Can anyone hook me up with parking spots that I can use to park overnight (preferably near livi) without having to leave by 6am"
    },
    {
        "postedAt": "2022-04-22 23:51:25",
        "text": "to the guy heckling ppl in front of the casc selling cookies on 4/21. you are mad cutee and u tried so hard to get ppl to help us out at our table (even tho u guilt tripped us into buying cookies) think your name started w an A or smth - one of the girls who was tabling",
        "campus": "collegeAve",
        "location": "College Avenue Student Center",
        "coordinates": "40.50290590142855, -74.45209439550206"
    },
    {
        "postedAt": "2022-04-23 00:13:07",
        "text": "4/22 to the girl at Demfest who was singing along w me to Take Off Ur Pants by Indigo De Souza as they were changing sets: I was the one w the mask n the mesh top! sorry for leaving, my group was gonna get ice cream. you wanna trade instas? or hang out??",
        "campus": "collegeAve",
        "location": "Demarest Hall",
        "coordinates": "40.50361591033291, -74.45032916797084"
    },
    {
        "postedAt": "2022-04-23 00:57:56",
        "text": "4/23 to the girl friday night who blew me a kiss around 12:45am and got on the lx bus from college Ave with your friends you had black hair a white shirt and light blue jeans hmu :)",
        "location": "LX"
    },
    {
        "postedAt": "2022-04-23 01:19:42",
        "text": "to the girl i guest swiped at the livi dining hall 4/22 ~11:30: wanna grab food sometime? i was meeting up with a friend today but u seem like a really cool person ",
        "campus": "livingston",
        "location": "Livingston Dining Commons",
        "coordinates": "40.52292907683804, -74.43796526374688"
    },
    {
        "postedAt": "2022-04-23 01:44:35",
        "text": "To the seniors of RPDC: I wish you all the best of luck in whatever adventures you go on next! You're all so talented, and I know you will accomplish great things! XOXO"
    },
    {
        "postedAt": "2022-04-23 02:37:04",
        "text": "Hi; I left my dark green jacket on the couch on 52 college ave couch this Friday and it had my glasses in there plz lemme know if you took it by accident!! ",
        "campus": "collegeAve",
        "location": " 52 College Ave",
        "coordinates": "40.49976938310936, -74.44877376904834"
    },
    {
        "postedAt": "2022-04-23 03:30:51",
        "text": "to the girl that accidentally gave their veggies to the women making my pasta at the pasta station at livi, thanks for the extra veggies 👍",
        "campus": "livingston",
        "location": "Livingston Dining Commons",
        "coordinates": "40.52289645818304, -74.43813692678846"
    },
    {
        "postedAt": "2022-04-23 03:54:54",
        "text": "To the boy who came up to me during my lunch break while I was working at The Yard and handed me a flower, it was really really sweet. I have been having a really rough week and that small act of kindness meant a lot to me.",
        "campus": "collegeAve",
        "location": "The Yard",
        "coordinates": "40.49954608487317, -74.44854533124261"
    },
    {
        "postedAt": "2022-04-23 13:44:07",
        "text": "(4/22) whoever the asian girl i danced w for a hot sec at like 130 at queens or hueys (i dont remember which 🙃) i was in the denim shirt—would be down to dance more, was fun :)",
        "campus": "collegeAve",
        "location": "Huey's Knight Club",
        "coordinates": "40.4997596086294, -74.45427183512203"
    },
    {
        "postedAt": "2022-04-23 09:23:49",
        "text": "(04/22) To the guy who was walking the tiniest, fluffiest puppy I’ve ever seen near Scott hall around 7:40pm thank you for letting me pet your dog it made my day so much better. I was the girl in a black tshirt, black jacket, jeans, and glasses so hmu if you’re ever down for coffee or drinks:)",
        "campus": "collegeAve",
        "location": "Scott Hall",
        "coordinates": "40.500431590760634, -74.44766930490611"
    },
    {
        "postedAt": "2022-04-23 10:01:45",
        "text": "there was a boy wearing a backwards north face shirt at queens last night. id really like to get to know you if given the chance! you’re really cute!",
        "campus": "collegeAve",
        "location": "Olde Queens Tavern",
        "coordinates": "40.4989026,-74.4542017"
    },
    {
        "postedAt": "2022-04-23 10:44:53",
        "text": "(4/23) to the group of super cute poc group at the yardbucks at like... 10:45 am or so today? the group where the asian girl where was wearing the blue snuggie thing? y'all look like you have immaculate vibes",
        "campus": "collegeAve",
        "location": "Starbucks",
        "coordinates": "40.499061626296694, -74.45198623720847"
    },
    {
        "postedAt": "2022-04-23 12:27:05",
        "text": "Not a missed connection but what is this Rutgers Met Gala thing? I’ve literally seen so many people post about it but haven’t heard anything officially and im so confused 😫"
    },
    {
        "postedAt": "2022-04-23 12:31:56",
        "text": "to the tall white guy with shoulder length hair at demfest hi ur cute lol",
        "campus": "collegeAve",
        "location": "Demarest Hall",
        "coordinates": "40.50352848117663, -74.45033284302714"
    },
    {
        "postedAt": "2022-04-23 12:51:09",
        "text": "To the girl who booped my nose at 52 College Ave (4/22), how did you know that’s my sensitive spot 😩😩😩",
        "campus": "collegeAve",
        "location": "52 College Ave",
        "coordinates": "40.49979385847087, -74.44879522597925"
    },
    {
        "postedAt": "2022-04-23 13:55:23",
        "text": "This was on Friday 04/22. To the guy who took the Lx bus from the yard, you were brunette wearing a black tank top w sweats and u had an orange/yellow backpack and I think u were carrying an Amazon package. You’re really cute and I was going to say hi to u but then you got off at the next bus stop after the yard. ",
        "location": "LX"
    },
    {
        "postedAt": "2022-04-23 14:24:57",
        "text": "To the guys who dismantled my bed last week fuck you guys ",
        "location": "your mom's house"
    },
    {
        "postedAt": "2022-04-23 14:36:55",
        "text": "To the girl short brown who lives on 2nd floor on Allen hall I think you’re really cute and your nose stud looks amazing.",
        "campus": "busch",
        "location": "Allen Residence Hall",
        "coordinates": "40.521539570310004, -74.45324665624535"
    },
    {
        "postedAt": "2022-04-23 15:15:05",
        "text": "to whoever was singing the attack on titan final season opening on cook doug on 4/23 at 3 ish, you made my day ",
        "campus": "cookDoug",
        "location": "Passion Poodle",
        "coordinates": "40.482808793027154, -74.43705952115896"
    },
    {
        "postedAt": "2022-04-23 16:42:59",
        "text": "Dominican girl that i had asked what language you were speaking on the phone, i like your energy, you should hmu"
    },
    {
        "postedAt": "2022-04-23 17:39:51",
        "text": "Yury. I’m sorry how things ended. It’s my greatest regret letting you go. I saw you in the Nielsen today and the memories came flooding back. I’m sorry about what happened and there was a reason for it and given the opportunity, I’d do it all over again. If you see this, just know, I’m incredibly remorseful",
        "campus": "cookDoug",
        "location": "Neilson Dining Hall",
        "coordinates": "40.48185706492709, -74.43148565193232"
    },
    {
        "postedAt": "2022-04-23 18:33:21",
        "text": "To the girl near the SAC around Bishop Quad on college ave on 4/23 around 6pm who complimented my outfit and said « it’s the bow for me » I already said you’re gorgeous but you’re so kind that really made my day!!",
        "campus": "collegeAve",
        "location": "Student Activities Center",
        "coordinates": "40.50435307566658, -74.44904576972303"
    },
    {
        "postedAt": "2022-04-23 18:34:17",
        "text": "All i need is a husband. Tall, big and strong, greek or italian or black or arab. Smart, funny , clean. respectful but disrespectful 😌. rich rich rich. and romantic. preferably one with nicely built legs and arms. why cant i find one. help",
        "location": "Horny Hall"
    },
    {
        "postedAt": "2022-04-23 19:08:15",
        "text": "To the blonde girl in the colorful pants and jean jacket  at the esports event hmu you’re really pretty "
    },
    {
        "postedAt": "2022-04-23 19:38:57",
        "text": "to the girls sitting at livi student center 2nd floor around 7:20pm. You had curly hair, boots on and wearing brown jacket. You were very pretty. I was the guy with dark blue hoodie and clear glasses sitting across from you. hmu :)",
        "campus": "livingston",
        "location": "Livingston Student Center",
        "coordinates": "40.52358674485989, -74.43718383828255"
    },
    {
        "postedAt": "2022-04-23 21:18:24",
        "text": "i’m a rising sophomore in engineering and looking for a girl roommate in morrow suites on busch. my friends are all super chill, hmu if you’re interested :) @julesscarvalho",
        "campus": "busch",
        "location": "Morrow Hall",
        "coordinates": "40.52539699130055, -74.46006386023573"
    },
    {
        "postedAt": "2022-04-23 21:19:44",
        "text": "I didn’t know engineers could serve like that until I saw the pics of the people running engineering formal like damnnnnnnn"
    },
    {
        "postedAt": "2022-04-23 22:08:56",
        "text": "(4/22) To girl wearing khaki leggings, black t-shirt with some anime design, and black/white converse doing hip thrusters at the Busch gym @2:50 you are stunning. I’m the guy who was wearing a red gymshark t-shirt and blue shorts doing bicep curls next to you. If you wanna work out sometime HMU!",
        "campus": "busch",
        "location": "Sonny Werblin Recreation Center",
        "coordinates": "40.519542138214476, -74.46090893133326"
    },
    {
        "postedAt": "2022-04-23 23:13:54",
        "text": "to the guy at Yardbucks today who offered to buy the homeless man who came in a hot chocolate and some food items - I think your name was Jake or jack? I’m not sure but you left before I could say anything, I really respected that you took the time to talk to him and wait on line with him even though you had already gotten your drinks. It was really touching to see that happen at work and you have a really good heart",
        "campus": "collegeAve",
        "location": "Starbucks",
        "coordinates": "40.49927465053365, -74.44824035398373"
    },
    {
        "postedAt": "2022-04-23 23:39:07",
        "text": "(4/23) the guy on the weekend 2 around 11:30 pm dressed in all black with three black bags ,with a long earring on and with slides , you were cute af  even if you are not 💅, we love cute straight friends 😙",
        "location": "Weekend 2 Bus"
    },
    {
        "postedAt": "2022-04-24 00:43:26",
        "text": "Hello. I have this entrepreneurship class that I am doing a project for. It’s a StartUp business project. My project is called Artists for Artists.  My group sells paintings, videography, handicrafts and in the process of working with digital artists.   There isn’t much sample pictures at the moment. But once people start emailing about this project. My group and I will email them back of more information about this project.",
        "location": "entrepreneurship class"
    },
    {
        "postedAt": "2022-04-24 00:49:19",
        "text": "To the girl i held the door open and then took the elevator with in campbell, I regret not asking your name. You were cute and if you see this hmu",
        "campus": "collegeAve",
        "location": "Campbell Hall",
        "coordinates": "40.50547799224393, -74.45118756360033"
    },
    {
        "postedAt": "2022-04-24 01:34:53",
        "text": "hi ! so i work at 16h (4/23) and while i was closing there was a guy who waved at me through the window and before that he came in and asked me how my day was and it was a while before i was asked that genuinely but anyways, i had to do a double take bc i didn’t recognize you at first but you were really sweet and the gesture made me smile so if u see this thank u and hmu 🤙🏼",
        "campus": "livingston",
        "location": "16 Handles",
        "coordinates": "40.525596272501836, -74.43769556906288"
    },
    {
        "postedAt": "2022-04-24 01:56:02",
        "text": "To the two girls who said they didn’t like the fifth floor of the honors college if you don’t like it stay on your own fucking floor then",
        "campus": "collegeAve",
        "location": "The Honors College of Rutgers",
        "coordinates": "40.50256416507361, -74.44701158052378"
    },
    {
        "postedAt": "2022-04-24 02:02:39",
        "text": "Ben from yard bus stop, we’ll never forget you. Stay cool and keep yankee-ing. but like lowkey lol u gotta chill w the homophobic slurs",
        "campus": "collegeAve",
        "location": "The Yard",
        "coordinates": "40.49939431197356, -74.44844097702017"
    },
    {
        "postedAt": "2022-04-24 02:04:51",
        "text": "To whoever was peeing outside in the grass near the quad three bus stop, that’s was so funny and we could hear the stream from our room",
        "campus": "livingston",
        "location": "Quad Three Residence Hall",
        "coordinates": "40.520790540821274, -74.4340635222556"
    },
    {
        "postedAt": "2022-04-24 02:23:26",
        "text": "To the guy I saw walking infront of Panera at around 2:30pm on Friday (04/22). You had a butterfly tattoo on your thigh and it looked so good, you were wearing a cream coloured sweater. You were fine as hell tho. Don’t know if you’re 💅 but you were so so cute! Hope you have a good day!!",
        "campus": "collegeAve",
        "location": "Panera Bread",
        "coordinates": "40.50269578934886, -74.45161987216977"
    },
    {
        "postedAt": "2022-04-24 02:40:01",
        "text": "to Alex from the Gamma Phi Beta party: be my personal trainer?",
        "campus": "collegeAve",
        "location": "Gamma Phi Beta",
        "coordinates": "40.50078832603445, -74.45020006593927"
    },
    {
        "postedAt": "2022-04-24 02:53:35",
        "text": "to all the models at chinanite: yall looked amazing n killed it on stage"
    },
    {
        "postedAt": "2022-04-24 03:23:20",
        "text": "To the girl who I believe called me cute on the weekend 2 bus at like midnight Sunday (4/24) at the Busch student center before you got off, hmu! You were wearing a green top and seemed really chill.",
        "location": "Weekend 2 Bus"
    },
    {
        "postedAt": "2022-04-24 03:48:29",
        "text": "To whoever called the RA on the party in the Newell Apartments last night: 1) you're a bad person, you're a snitch, your mom's a hoe, etc, and 2) I ended up dislocating my knee at the place I went to instead and I blame you entirely. Will be seeking compensation for damages",
        "campus": "cookDoug",
        "location": "Newell Apartments",
        "coordinates": "40.47757610085546, -74.42986687408255"
    },
    {
        "postedAt": "2022-04-24 10:01:32",
        "text": "If you’re living in winkler next year, hit us up ",
        "campus": "busch",
        "location": "Winkler Hall",
        "coordinates": "40.52537257840466, -74.45837023214342"
    },
    {
        "postedAt": "2022-04-24 11:19:40",
        "text": "(4/22) not a missed connection but to the guy who drugged me at hueys i sincerely hope you break every bone in your body and then some and shout out to my friends for taking care of me❤️ ",
        "campus": "collegeAve",
        "location": "Huey's Knight Club",
        "coordinates": "40.4997596086294, -74.45427183512203"
    },
    {
        "postedAt": "2022-04-24 15:15:43",
        "text": "To Chris whose drink I accidentally kicked over last week. I’m glad we squashed the beef but I still feel bad. Hmu so I can take you out for a replacement."
    },
    {
        "postedAt": "2022-04-24 17:53:34",
        "text": "04/25/22 To the cute guy at the front of the packed weekend bus after the hill center bus stop who stood behind me. I was wearing a cap/ headphones. The moment when the bus hit a sudden stop and you grabbed the handle next to my head, my heart stopped, it was like a scene from a movie 😭. This might sound stupid but if you ever wanna hangout or talk, comment so we can connect? ",
        "campus": "busch",
        "location": "Hill Center",
        "coordinates": "40.522107704323474, -74.4626988737795"
    },
    {
        "postedAt": "2022-04-24 18:45:19",
        "text": "To the person I saw looking at my orgo test, you’re looking at the wrong persons test sorry bro wish i coulda helped"
    },
    {
        "postedAt": "2022-04-24 19:18:15",
        "text": "Hey I’m a freshman thats had a hard time making friends, i like f1 and videos games and from New York. Just looking for some other loners who wanna just hang out and do something fun etc. Im so bored here without friends if you wanna be friends lmk!"
    },
    {
        "postedAt": "2022-04-24 19:48:25",
        "text": "to the girl in the black harry potter crewneck sunday night at 7:45 in the livi dining hall, sitting with the girl in the white tank top. disrespectfully. you’re fine as Fuck and i would love to take you out for bagels  ",
        "campus": "livingston",
        "location": "Livingston Dining Commons",
        "coordinates": "40.52285609429245, -74.43810790285734"
    },
    {
        "postedAt": "2022-04-24 19:57:54",
        "text": "To the person last night at the yard who complimented my hair and outfit and overall aesthetic you literally made my week",
        "campus": "collegeAve",
        "location": "The Yard",
        "coordinates": "40.49936684585267, -74.4484338846072"
    },
    {
        "postedAt": "2022-04-24 20:34:45",
        "text": "To the dude with long hair and black nail polish who was sitting across from me on one of the weekend busses, you looked just as uncomfortable as I felt with all the maskless people. Wanna bond over it?-the one with the rainbow Ruth Bader Ginsberg mask",
        "location": "weekend buss"
    },
    {
        "postedAt": "2022-04-24 21:37:04",
        "text": "To the asian girl with red hair and pink jacket at Livi dining hall I was the one who complimented you about your hair but I forgot to ask your name, your cute asl:)",
        "campus": "livingston",
        "location": "Livingston Dining Commons",
        "coordinates": "40.52287469093012, -74.43813576106908"
    },
    {
        "postedAt": "2022-04-24 21:49:46",
        "text": "To the tall brown guy holding a hammer at his  graduation photo shoot in front if Richard weeks on 3/23….hmu you cute as hell 🤩🙃",
        "campus": "busch",
        "location": "Rutgers Richard Weeks Hall of Engineering",
        "coordinates": "40.52467191450876, -74.4595450479258"
    },
    {
        "postedAt": "2022-04-24 22:39:24",
        "text": "To the Asian girl at Neilson dining hall (4/24 at 6-7ish) with short green hair, star earrings and a striped green shirt, you’re absolutely gorgeous! Hmu if you’re single!",
        "campus": "cookDoug",
        "location": "Neilson Dining Hall",
        "coordinates": "40.48177325370437, -74.43155855819758"
    },
    {
        "postedAt": "2022-04-24 22:54:11",
        "text": "How many other people think the concept of Rutgers making tuition paying students pay extra money for parking is extremely predatory? I don’t know why people have been taking it sitting down for so long… there’s nearly 70,000 students, what’s stopping us from protesting it by this point? "
    },
    {
        "postedAt": "2022-04-25 03:47:24",
        "text": "To dan in mikes monday morning bio lab im only sending this in now cuz we dont have class anymore and im a puthy you should hmu im the other korean in the class 😌",
        "campus": "collegeAve",
        "location": "Jersey Mike's Subs",
        "coordinates": "40.499714115984844, -74.44852983317142"
    },
    {
        "postedAt": "2022-04-25 04:24:57",
        "text": "To the east-asian girl who wore a blue hoodie, black vest, and black leggings that took a train from Penn Station NY to New Brunswick (9:16pm) on Sunday 4/24 with an east-asian guy who wore a beige hoodie, plz hmu. That guy (K.A.) isn't worth any single bit of your time and I am talking from experience. I regret for not walking up because I didn't want to make a scene, but he is absolutely shitty.",
        "campus": "collegeAve",
        "location": "New Brunswick Train Station",
        "coordinates": "40.49667986964707, -74.44609302849251"
    },
    {
        "postedAt": "2022-04-25 11:28:59",
        "text": "To the girl in my comp apps recitation class (sameer’s) who always wore white air forces with the yellow swoosh, I sat next to you every Monday and literally never knew when to talk to you cause it’s kind of a busy class 😭 Today I asked you how to add the percentage point in our assignment but wanted to talk a lil more tbh cause your eyes were beautiful so if you see this I’d love to hit you up ",
        "location": "comp apps class"
    },
    {
        "postedAt": "2022-04-25 11:39:29",
        "text": "To the girl named sahani who walks past my seat to get to her seat in our expos class with prof. ziner I think you’re really pretty and I wanna take u out sometime",
        "location": "Expos Class"
    },
    {
        "postedAt": "2022-04-25 11:51:29",
        "text": "To the person who stopped in front of the DSC on 4/26 at 11:30am to help the elderly driver with directions…you’re a saint. To the person who then FLEW over the double yellow lines, passing on the left on Nichol Avenue while honking at me with my hazards on as the elderly woman followed me to her destination, learn some patience. She was handicapped, she’s someone’s grandmother. You could have hurt a lot of people. Please be kind. ",
        "campus": "cookDoug",
        "location": "Nichol Ave",
        "coordinates": "40.48160721772998, -74.44080796606636"
    },
    {
        "postedAt": "2022-04-25 11:52:36",
        "text": "(4/25) To girl walking down college ave by Panera in a pink sweater and green pants with a gray backpack you’re really cute I’d love to get to know you better. ",
        "campus": "collegeAve",
        "location": "Panera Bread",
        "coordinates": "40.5026960891045, -74.45162639345848"
    },
    {
        "postedAt": "2022-04-25 13:08:27",
        "text": "Is anyone subleasing for a semester in Easton ave or verve?  If so please lmk I would like to fill in for either fall or spring! Thank you guys :) ",
        "campus": "collegeAve",
        "location": "Verve",
        "coordinates": "40.49831384479876, -74.45060293032061"
    },
    {
        "postedAt": "2022-04-25 13:22:43",
        "text": "4/25 To the thicc Indian girl with the jeans and the white underwear pulled up high and the black sports bra who was in kilmers around 1:20--are you single and are you gay",
        "campus": "livingston",
        "location": "Kilmer's Market",
        "coordinates": "40.52576372455097, -74.43879895708778"
    },
    {
        "postedAt": "2022-04-25 14:21:03",
        "text": "to the tall guy with black wavy hair and clear-ish glasses who was wearing adidas pants and white shoes today. You’re cute asf. We always take the train the same train from eastwick (pls pick up what I’m putting down, I don’t wanna put our city out there 😭) to school. I’ve been meaning to walk up to you but I never have time cause I’m usually late for work or class LMAO",
        "campus": "collegeAve",
        "location": "New Brunswick Train Station",
        "coordinates": "40.49667027568666, -74.44607054186679"
    },
    {
        "postedAt": "2022-04-25 15:22:25",
        "text": "to the girl next to me at brower 4/25 watching critikal, i loved ur doc martens and ur utube taste. share an airpod next time? :)",
        "campus": "collegeAve",
        "location": "Brower Commons",
        "coordinates": "40.50384494152471, -74.45158949576533"
    },
    {
        "postedAt": "2022-04-25 15:41:13",
        "text": "to the guy who was wearing all black at the college ave gym on 4/25 around 8:40 AM hi, I think we lived in the same dorm freshman year and I think you're super cute would love to get coffee or drinks some time :)",
        "campus": "collegeAve",
        "location": "College Ave Gym",
        "coordinates": "40.50328913739564, -74.4527531685962"
    },
    {
        "postedAt": "2022-04-25 16:31:18",
        "text": "04/24 to whoever taught me that you can ask for garlic TWICE at the Livingston pasta bar around 4. THANK YOU SO MUCH that pasta was good asf",
        "campus": "livingston",
        "location": "Livingston Dining Commons",
        "coordinates": "40.522871990912286, -74.43808328303173"
    },
    {
        "postedAt": "2022-04-25 17:06:50",
        "text": "To the guy on the lx at 5 pm on 4/25 talking about roller blading. Please teach me how to Rollerblade better, I am a beginner. I was the girl in the short skirt. ",
        "location": "LX"
    },
    {
        "postedAt": "2022-04-25 17:55:17",
        "text": "Thank you to the bus driver around 5:45 PM today who honked at me to let me know a car was coming while I was crossing the street to Alex! I did not see the car coming. An award should go out to him! Shout out to all Rutgers bus drivers and what they do!! And I hope the person that was speeding down past the bus on College Ave knows to next time slow down for pedestrians. ",
        "campus": "collegeAve",
        "location": "Archibald S. Alexander Library",
        "coordinates": "40.50491919911637, -74.45255716197502"
    },
    {
        "postedAt": "2022-04-25 17:57:17",
        "text": "Is there someone at Rutgers who can teach how to play tennis? I have legit never played tennis before in my life and I would like to learn at some point."
    },
    {
        "postedAt": "2022-04-25 18:35:03",
        "text": "not a missed connection but anyone wanna be in an Asian groupchat where we can vibe and stuff, and maybe hangout during the last weeks of the semester??"
    },
    {
        "postedAt": "2022-04-25 19:26:03",
        "text": "(4/25) to the person who airdropped me a picture of a carrot on the floor of the neilson dining hall (I think the senders name was brenda) thank you for that I really needed that in my life it was life changing.",
        "campus": "cookDoug",
        "location": "Neilson Dining Hall",
        "coordinates": "40.48179994312222, -74.43156075576789"
    },
    {
        "postedAt": "2022-04-25 19:56:24",
        "text": "To the blonde girl wearing darkgrev/black jeans and white topin brower around 4 o'clock (4/25)I thought u were mad cute and Iwas too pussy to come talk to u.I'd love to talk to u more hmu",
        "campus": "collegeAve",
        "location": "Brower Commons",
        "coordinates": "40.5037470460003, -74.45149293891376"
    },
    {
        "postedAt": "2022-04-25 20:02:40",
        "text": "to that dude at the girls gone bad party @ shio lounge that looked like chris brown: you are so fine, i hope i see you again ;)"

    },
    {
        "postedAt": "2022-04-25 20:13:30",
        "text": "If you lost a photocopy of your SS card in Alex on 4/25 — don’t worry, we shredded it, you r all good.",
        "campus": "collegeAve",
        "location": "Alexander Library",
        "coordinates": "40.504984460675374, -74.45257861772129"
    },
    {
        "postedAt": "2022-04-25 21:01:54",
        "text": "To the couple going at it in the fifth floor Honors College bathroom, I hope you had a good time.",
        "campus": "collegeAve",
        "location": "The Honors College of Rutgers",
        "coordinates": "40.502589736718605, -74.44704285638102"
    },
    {
        "postedAt": "2022-04-25 21:15:13",
        "text": "To the girl singing upstairs in 15 hartwell I could hear you when I parked my car. You sounded really good let me get your EP when it drops",
        "campus": "collegeAve",
        "location": "15 Hartwell St",
        "coordinates": "40.497678731453426, -74.45464821017731"
    },
    {
        "postedAt": "2022-04-25 22:06:52",
        "text": "To the tall guy at C/D gym on 4/25 around 9-10 pm with the grey sleeveless tank, maroon pants and long-ish hair, I’ve seen u at the gym before and I think you’re really cute:) ",
        "campus": "collegeAve",
        "location": "15 Hartwell St",
        "coordinates": "40.49769988441906, -74.45456150637311"
    },
    {
        "postedAt": "2022-04-25 22:36:28",
        "text": "any better call saul fans wanna talk about season 6 together? episode 3 has me an emotional wreck 😞"
    },
    {
        "postedAt": "2022-04-25 22:44:53",
        "text": "To the boy sitting next to me on the LX on 4/25 a little after 5:30pm who just randomly told me he liked my hair, you are so sweet :’) that literally made my whole day thank you <3 ",
        "location": "LX"
    },
    {
        "postedAt": "2022-04-25 23:01:28",
        "text": "This one is for the guy who broke my heart out of nowhere late last Tuesday night, you completely disrespected me and made me question my worth. The worst thing of all is that I still miss you. I feel like I lost a best friend. I can’t stop crying at the thought of you.I hope you are doing well and taking care of yourself because I still care about you. I know you don’t read these, so that’s why I am writing this."
    },
    {
        "postedAt": "2022-04-25 23:16:24",
        "text": "is anyone going to see the weeknd on july 16 and wants to make a gc"
    },
    {
        "postedAt": "2022-04-25 23:35:09",
        "text": "hey! i’m a rising sophomore (she/her) who’s looking to get into the gym to build muscle mass. i was wondering if anyone could help me out? be my gym partner to help me start?"
    },
    {
        "postedAt": "2022-04-25 23:58:08",
        "text": "is anyone going to the keshi concert on may 22? lmk!! i don’t want to go alone 🥲"
    },

    {
        "postedAt": "2022-04-26 01:14:45",
        "text": "To the guy I followed recently on Instagram and asked for my Snapchat. I genuinely thought you were really cute and tbh I wanted you to ask for my number instead."
    },
    {
        "postedAt": "2022-04-26 07:45:07",
        "text": "sometimes its really freaky how i see the same people on campus and i dont even dorm. to nick from my hs: stop showing up everywhere. to gracie: ive always wanted to say hi to u and compliment ur dancing but im scared 😭 "
    },
    {
        "postedAt": "2022-04-26 08:11:01",
        "text": "To the guy wearing a bright blue helmet while skateboarding on Busch campus, you might actually be the smartest student at Rutgers. 👏👏👏 Give ur parents a hug for me.",
        "campus": "busch",
        "location": "Around Busch",
        "coordinates": "40.52360723655326, -74.46281285620285"
    },
    {
        "postedAt": "2022-04-26 10:17:56",
        "text": "To the guy with dark hair wearing a grey champion sweatshirt on the lx around 10am today (4/26)… I think you are really cute:) We both got off at the livi plaza stop, but I was in a rush so I didn’t have time to ask for your number. I was the girl wearing the oversized green plaid jacket, black leggings and grey sneakers. I have brown hair with highlights and I wear glasses. You might have caught me looking at you a few times lol. I hope you found me cute as well! Hmu :)",
        "location": "LX"
    },
    {
        "postedAt": "2022-04-26 10:24:39",
        "text": "To the guys who keeps disrespecting the professor in Principles of Electrical Engineering 2, Can you guys grow up? Literally you are not high schoolers anymore. You are taking advantage of him for being nice and you guys keeps disrespecting him right in his face. Just because you are smart doesnt mean you have the right to be disrespectful. You guys are also the loudest people in the class and you are affecting other students,  this is college! We paid thousands for this shit. Act like adults.",
        "campus": "collegeAve",
        "location": "Principles of Electrical Engineering Class"
    },
    {
        "postedAt": "2022-04-26 12:53:46",
        "text": "I was walking down George Street by College Hall and a girl shouted something out of the backseat of a black car. I’m sorry, I really didn’t catch anything you said. I was wearing a white shirt and black cardigan. Let me know what it was!",
        "campus": "cookDoug",
        "location": "College Hall",
        "coordinates": "40.486499325229374, -74.43719149140139"
    },
    {
        "postedAt": "2022-04-26 13:05:56",
        "text": "to the east asian guy in a black tank at werblin around 11am on 11/26, if you’re single hml",
        "campus": "busch",
        "location": "Sonny Werblin Recreation Center",
        "coordinates": "40.519577493314834, -74.46084178303502"
    },
    {
        "postedAt": "2022-04-26 14:29:59",
        "text": "Tues 4/26 to the blonde in fritz around 2:30 I think your name was sky (such a cool name) you were really pretty hmu if you see this ",
        "campus": "collegeAve",
        "location": "Fritz's",
        "coordinates": "40.49920474156078, -74.45194584293732"
    },
    {
        "postedAt": "2022-04-26 14:39:18",
        "text": "4/26 To the girl with about shoulder length (?) hair that I briefly locked eyes with under the tent in front of Cafe West; I looked away because I was nervous, but you were pretty cute. Hmu",
        "campus": "collegeAve",
        "location": "Cafe West",
        "coordinates": "40.50155270578214, -74.44820250828582"
    },
    {
        "postedAt": "2022-04-26 14:39:28",
        "text": "To the boy that held the elevator for me Monday night/Tuesday morning at like 1am in BEST East. I thought you were pretty cute, hmu if you’re not a freshman",
        "campus": "busch",
        "location": "BEST East",
        "coordinates": "40.52190034094479, -74.45481793022138"
    },
    {
        "postedAt": "2022-04-26 15:08:54",
        "text": "To the guy who came in the space to pray Zuhur and asked if I prayed. You had this blue shirt on, and I was reading Quran and I was wearing a Nasa Hoodie, your beard is immaculate mashallah i wanted to say that but you left lol "
    },
    {
        "postedAt": "2022-04-26 15:15:30",
        "text": "Friends cafe on 4/26 afternoon, whoever was on aux has exquisite music taste, brought me pure joy. ",
        "campus": "collegeAve",
        "location": "Friend's Cafe",
        "coordinates": "40.49846210864569, -74.45639836684573"
    },
    {
        "postedAt": "2022-04-26 15:35:00",
        "text": "to the guy at kilmers 4/26 at about 3:30pm with the alpha phi? leather jacket you are SO fine. pls model",
        "campus": "livingston",
        "location": "Kilmer's Market",
        "coordinates": "40.52576372455097, -74.43879895708778"
    },
    {
        "postedAt": "2022-04-26 15:39:53",
        "text": "Men - only sending imessage games is not cute, talk to her, ask her to hang out, don’t just send her 8ball that’ll make her lose interest soooo fast "
    },
    {
        "postedAt": "2022-04-26 16:00:03",
        "text": "(4/26) to the girl who spoke to me about how her life was going on LIVI A apartment around 3:50pm ish, spoke Spanish to me and went all the way to the 7th floor with me in the elevator, you single? 👀",
        "campus": "livingston",
        "location": "Livingston Apartments Building A",
        "coordinates": "40.52586415928807, -74.43816909809048"
    },
    {
        "postedAt": "2022-04-26 16:02:08",
        "text": "(4/26) @ around 3:30, to the girl in the grey hoodie and high top commes des garcon’s that was sitting in front of me on the LX, you fine as hell hmj 🙏🏾",
        "location": "lx"
    
    },
    {
        "postedAt": "2022-04-26 16:08:38",
        "text": "(4/26) to the curly headed hispanic? boy at the CA gym who always wears those silver headphones hmu- asian girl",
        "campus": "collegeAve",
        "location": "College Avenue Gym",
        "coordinates": "40.50314626890807, -74.4526413601676"
    },
    {
        "postedAt": "2022-04-26 16:15:00",
        "text": "to the girl getting off the B bus @BSC who complimented my phone beads and said i was pretty... ur so gorgeous omg ! lets be friends <3 ",
        "campus": "busch",
        "location": "Busch Student Center",
        "coordinates": "40.52331990140866, -74.4581855405819"
    },
    {
        "postedAt": "2022-04-26 16:56:20",
        "text": "4/26 to the tall guy wearing a dark blue puffy jacket and black and red nike sneakers at the Busch dining hall around 4, your hair looks so nice, how is it so fluffy??? wondering if you're a friendly giant and would like to get to know you <3",
        "campus": "busch",
        "location": "Busch Dining Hall",
        "coordinates": "40.52256959146798, -74.4577778728296"
    },
    {
        "postedAt": "2022-04-26 17:56:56",
        "text": "to the 3 girls walking near the college ave parking deck/library who mimicked how the girl running past you was running after she passed, ur not cool. hope u dropped ur coffees (4/26 around 6 pm)",
        "campus": "collegeAve",
        "location": "Archibald S. Alexander Library",
        "coordinates": "40.50473156208843, -74.4520421837661"
    },
    {
        "postedAt": "2022-04-26 18:05:20",
        "text": "Asian girl in the yellow jacket with matching yellow phone case on the B bus leaving the BSC at 6 today you're so cute, and u should hmu😉",
        "campus": "busch",
        "location": "Busch Student Center",
        "coordinates": "40.52331990140866, -74.4581855405819"
    },
    {
        "postedAt": "2022-04-26 18:08:17",
        "text": "To the people that ordered four milkshakes without tipping and made an inappropriate comment about cherries, respectfully don’t ever treat any server like that ever again ;)"
    },
    {
        "postedAt": "2022-04-26 18:16:46",
        "text": "To my roommate who called us last Saturday night (4/23) saying that you got arrested for selling illegal drugs, asking us for $1,000 to bail you out, and had your friend impersonate a police officer to have him take our personal information, and then you proceed to tell me that you were hiding illegal shit in our room, pretend to get rid of it in our toilet, telling us “whatever is said and done in this suite stays in this suite”, and then tells us that it was a “prank” more than 24 hours after the incident, when I already tore my room apart making sure you didn’t slip anything in my belongings, when we all contacted our parents as well as our RA as well as his supervisor and almost RUPD, fuck you. Oh and I also had an orgo II exam and a physics II exam during those 24 hours so I hope you feel accomplished.",
        "campus": "busch",
        "location": "McCormick Suites",
        "coordinates": "40.52492971405857, -74.45874753420773"
    },
    {
        "postedAt": "2022-04-26 18:23:55",
        "text": "To the boys playing golf outside livi A... who won?",
        "campus": "livingston",
        "location": "Livingston Apartments Building A",
        "coordinates": "40.52586415928807, -74.43816909809048"
    },
    {
        "postedAt": "2022-04-26 18:30:52",
        "text": "(4/26) the girl who was knitting in databases lecture today, POP OFF QUEEN. join stitch for life so we can knit/crochet together <33",
        "location": "databases lecture"
    },
    {
        "postedAt": "2022-04-26 18:40:34",
        "text": "To the four mfs in BSC on 4/26 around 6:30 that were literally screaming and doing the Dr. Strange portal opening thing literally shut the fuck up holy fucking shit most obnoxious and childish shit i’ve ever witnessed take that outside like holy fuck",
        "campus": "busch",
        "location": "Busch Student Center",
        "coordinates": "40.52334436898049, -74.45824991299665"
    },
    {
        "postedAt": "2022-04-26 19:29:13",
        "text": "does anyone have an extra ticket to see rina sawayama and need someone to go with?? pls💗"
    },
    {
        "postedAt": "2022-04-26 22:01:35",
        "text": "To the kids who left all their trash in the BEST East lounge, clean up after yourselves 😁😁😁",
        "campus": "busch",
        "location": "BEST East",
        "coordinates": "40.52193240207497, -74.45537575606129"
    },
    {
        "postedAt": "2022-04-26 22:09:37",
        "text": "to the blonde girl w the short curly hair and the arm tat at hardenburg on 4/23 n i waved to u outside el jefes, idk if ur single but i’m like obsessed w you u look like a fairy <3",
        "campus": "collegeAve",
        "location": "Hardenbergh Hall",
        "coordinates": "40.50474254775383, -74.44974592360344"
    },
    {
        "postedAt": "2022-04-27 01:11:47",
        "text": "to the girl that works at livi gym and was at the basketball courts around 9pm diya I think? you’re so fine hmu :)",
        "campus": "livingston",
        "location": "Livingston Recreation Center",
        "coordinates": "40.521274174568504, -74.43089863872096"
    },
    {
        "postedAt": "2022-04-27 01:43:06",
        "text": "To the white Toyota with the New York license plate on Hamilton street that I egged. I apologize I was trying to egg my friends car opsies://// ",
        "campus": "collegeAve",
        "location": "Hamilton St",
        "coordinates": "40.48966081597019, -74.4776499985458"
    },
    {
        "postedAt": "2022-04-27 11:21:19",
        "text": "To the person who called my sandwich “max effort” (4/26) in the Livi Dining Hall thank you. Sadly it exploded over me and I never truly enjoyed it.",
        "campus": "livingston",
        "location": "Livingston Dining Commons",
        "coordinates": "40.522888192487784, -74.4381905707032"
    },
    {
        "postedAt": "2022-04-27 12:31:31",
        "text": "Not a missed connection, but im tryna get out of my Verve lease, who tryna take it over?",
        "campus": "collegeAve",
        "location": "Verve",
        "coordinates": "40.498303646327464, -74.45060896531075"
    },
    {
        "postedAt": "2022-04-27 13:39:24",
        "text": "04/27 cute asian guy studying on the second floor of the academic west building at around 1 pm with a red backpack, silver headphones,  u had a paper bag next to your computer hmu we should hang out sometime",
        "campus": "collegeAve",
        "location": "Academic Building - West",
        "coordinates": "40.50172729099856, -74.44811689907748"
    },
    {
        "postedAt": "2022-04-27 13:54:35",
        "text": "4/27. There was two brown girls at LSM around 1:30pm, one was wearing a blue shirt and the other was wearing a white and brown shirt. The girl with the white and brown shirt your smile was so cute, hmu. I was gonna talk to you but you guys left like right after I got there ",
        "campus": "busch",
        "location": "Library of Science and Medicine",
        "coordinates": "40.524826381146326, -74.46730620118609"
    },
    {
        "postedAt": "2022-04-27 16:00:56",
        "text": "To the girl that was walking in front of Butler Wednesday at like 4ish with the black hoodie that had “North Hollywood, CA” on the back….I had like this vision of a photo with a really long telephoto lens and the background of the gas station and Pub all blurred out. Just thought that aesthetic was really cool and you were walking away from me so I never got to see your face but I fuck with the whole vibe heavy ",
        "campus": "collegeAve",
        "location": "Butler Food Store",
        "coordinates": "40.499413579242194, -74.45195929452271"
    },
    {
        "postedAt": "2022-04-27 18:40:26",
        "text": "Hey guys, I’m in a suite with 5 other incoming sophomore girls for next year in Morrow. I’m not able to live on campus anymore so if you want my spot please please lmk asap. @shrutikhandelwal_",
        "campus": "busch",
        "location": "Morrow Hall",
        "coordinates": "40.52541754677397, -74.46006978605779"
    },
    {
        "postedAt": "2022-04-27 19:19:11",
        "text": "(This happened on 4/27) Hii to the girl that gave me a mask at the sac at like 12:30 THANK YOU😭 i was so embarrassed that I didn’t have one, if you see this please reach out to I can repay you with like food or something also I didn’t say this before becuase I was rushing but I also thought you were very cute ☺️ 😭 ",
        "campus": "collegeAve",
        "location": "Student Activities Center",
        "coordinates": "40.50437205931855, -74.44915913996819"
    },
    {
        "postedAt": "2022-04-27 22:58:15",
        "text": "to the 3 brown dudes sitting in the RBS 5th floor lounge on 4/27 around 10pm who asked my friend & i “why are books important” and proceeded to make the absolute funniest commentary as you guys were finishing up your work, you made our night kings keep up the good work lads",
        "campus": "livingston",
        "location": "Rutgers Business School",
        "coordinates": "40.523787581528005, -74.44060511200078"
    },
    {
        "postedAt": "2022-04-28 11:03:28",
        "text": "to the guy that was sitting on the bench in front of the college ave gym at like 9:10 pm on 4/27, please tell me you are 💅🏻 bc u were so fine",
        "campus": "collegeAve",
        "location": "College Ave Gym",
        "coordinates": "40.5031014929298, -74.45215235846094"
    },
    {
        "postedAt": "2022-04-28 11:25:30",
        "text": "To the mf in my criminology class at 10:20 am with Hayes, you’re genuinely so annoying despite not doing much, anti masking, drinking loudly asf in class, and mouth breathing LOUD ASF, not just you but you and your girlfriend next to you both with no class, you’ve done it everyday where the professor gave up on telling you to mask up, how much of a baby are you, if you’re not going to wear a mask at least breathe aour your nose lmao"
    },
    {
        "postedAt": "2022-04-28 13:48:53",
        "text": "To the girl in my business ethics class that presented last out of 50 students, I just want to say you’re very attractive. Don’t know what your name is but hopefully I get to see you around! "
    },
    {
        "postedAt": "2022-04-28 13:54:28",
        "text": "To the girl named Jay-Y (I'm sorry I don't know how to spell it), you complimented my outfit at the yard. I brain farted like crazy and missed the chance to ask for your number. Hmu (4/28)",
        "campus": "collegeAve",
        "location": "The Yard",
        "coordinates": "40.499363585239706, -74.44841794871522"
    },
    {
        "postedAt": "2022-04-28 14:12:33",
        "text": "Not a missed connection, but any breaking bad / better call Saul fans trying to meet and discuss how crazy this show is "
    },
    {
        "postedAt": "2022-04-28 14:15:29",
        "text": "the guy way ahead of me in line for henrys thursday 4/28 in the fish hoodie and modelo hat: youre really cute! too bad there was another group between us",
        "campus": "livingston",
        "location": "Henry's Diner",
        "coordinates": "40.52525716528697, -74.43938178166997"
    },
    {
        "postedAt": "2022-04-28 15:01:15",
        "text": "04/28: to the brown guy (abhi) on the B bus around 2, who I talked to on the bus the whole ride. you were really cute and u told me your instagram while getting down the bus but i couldn’t find u so i hope this reaches to u ",
        "location": "B"
    },
    {
        "postedAt": "2022-04-28 15:05:39",
        "text": "Not a missed connection, but will anyone else be living in Campbell Hall 5th floor for next year? I’d love to meet new people and get to know y’all!",
        "campus": "collegeAve",
        "location": "Campbell Hall",
        "coordinates": "40.50558806589452, -74.45117518306785"
    },
    {
        "postedAt": "2022-04-28 15:11:53",
        "text": "4/28 To the girl named Tina who came up to me in the livi student center because she thought I was sad. YOU DESERVE THE WORLD🤍 that was so sweet it made my day!",
        "campus": "livingston",
        "location": "Livingston Student Center",
        "coordinates": "40.5235132375752, -74.43730185809788"
    },
    {
        "postedAt": "2022-04-28 15:35:57",
        "text": "To the girl with the amazing white afro in the colorful top and white skirt, I sat next to you on the REXL this morning at around 11:45am--your style is immaculate and I want to be your friend but I was too shy to say anything :p ",
        "location": "REXL"
    },
    {
        "postedAt": "2022-04-28 16:40:40",
        "text": "To the tall blonde guy who was at yardbucks around 4.30 with paper clip earrings and tattoos, you seem really cool :)",
        "campus": "collegeAve",
        "location": "Starbucks",
        "coordinates": "40.49919899992076, -74.44830794267115"
    },
    {
        "postedAt": "2022-04-28 17:36:25",
        "text": "28/04 - to the starbucks barista who asked how to pronounce my name at the yard around 1:45pm that was so sweet and it made me feel so happy! i wish everyone was like you, unfortunately the majority don’t pay attention to other cultures. i’m the girl who got a venti iced latte with oat milk :)",
        "campus": "collegeAve",
        "location": "Starbucks",
        "coordinates": "40.4988723,-74.4488872"
    },
    {
        "postedAt": "2022-04-28 17:44:07",
        "text": "(4/28) The guy at the College Ave gym around 4:30ish wearing a black Colombia shirt, gray shorts, wired apple earplugs, and blue & white Adidas shoes … you are really cute ",
        "campus": "collegeAve",
        "location": "College Ave Gym",
        "coordinates": "40.50327282340754, -74.45284972903288"
    },
    {
        "postedAt": "2022-04-28 17:49:00",
        "text": "To the guy at the CA gym around 4:45ish in the room next to the power gym. You were wearing a white t shirt, light gray sweatpants and AirPods. You had a black backpack (wow that’s a tongue twister lol) and a blue water flask. You were stretching and I was working out in front of you. Just wanted to say you were super cute! ",
        "campus": "collegeAve",
        "location": "College Ave Gym",
        "coordinates": "40.50327282340754, -74.45284972903288"
    },
    {
        "postedAt": "2022-04-28 19:03:20",
        "text": "to anybody who wants hot friends AND more importantly has guest meal swipes they wanna get rid of PLEASE hmu "
    },
    {
        "postedAt": "2022-04-28 19:19:51",
        "text": "To the Black girl on LX around 7 w a bandana, camo pants, and a black puffer, I fw your sense of fashion heavy",
        "location": "LX"
    },
    {
        "postedAt": "2022-04-28 21:42:54",
        "text": "To all the Girls at Rutgers, How would you like to be approached by boys at the DINING HALLS, BUSES, on the BUS STOPS. Please be honest and give some guidance to all the single men who like someone but don't know how to approach in 2022😍🥰🤩😻🤔. DM at @anonymous_engg"
    },
    {
        "postedAt": "2022-04-28 22:44:07",
        "text": "To the red-head with the flat cap at the chabad house: you’re very attractive, let’s get married and breed tegu lizards together. I am very rich.",
        "campus": "collegeAve",
        "location": "Chabad House",
        "coordinates": "40.50411361294752, -74.45330400656323"
    },
    {
        "postedAt": "2022-04-28 22:53:51",
        "text": "To the tall (at least 5’11) Brown guy, who me and friend let into Easton Ave Apartments on 4.28 (Thursday) around 10:10pm, when we were walking in. I was wearing an all white suit and holding a bunch of stuff with a bookbag on my back with a Pokémon lunch box. We held the elevator open for u and I asked what floor after I had pressed 11, u said 8. U complimented my suit and I was like “it’s tight” and you were like “it looks good”… it didn’t register in my head at the time u coulda been flirting cuz I’m slow😭 anyway, ur mad cute dude and I’d love to hangout sometime before we leave campus, and get to know u, even if u were just tryna b friends. P.s. I had the colored stars on my face.",
        "campus": "collegeAve",
        "location": "University Center at Easton Avenue",
        "coordinates": "40.49694968992389, -74.44779898866845"
    },
    {
        "postedAt": "2022-04-28 23:12:11",
        "text": "To the girl who thought my friend and I had nice voices (outside the Loud professor class in livi lol) and that we should make a podcast, u seemed really cool as well but didn’t ask u for your name completely!!! "
    },
    {
        "postedAt": "2022-04-28 23:26:37",
        "text": "If you are being excessively loud in a library, please consider taking your discussion somewhere else :( many of us are trying to study and sometimes excessive noise can distract people from studying. Especially as finals get close. "
    },
    {
        "postedAt": "2022-04-29 01:29:37",
        "text": "to the guy that heard and saw my friends and i singing songs from waitress in my car outside the academic building on 4/28 around 9pm and started jamming w/ us while crossing the street, can we be friends pls",
        "campus": "collegeAve",
        "location": "Academic Building",
        "coordinates": "40.50178215344104, -74.44827028811086"
    },
    {
        "postedAt": "2022-04-29 07:25:02",
        "text": "To the south asian girl that works at the front desk at Livi gym I see you every Monday night and you’re so fine respectfully. We had one small interaction when you gave me a bandaid but wish I could’ve talked to you for longer. I know it’s really late into the semester but let me take you out please? ",
        "campus": "livingston",
        "location": "Livingston Recreation Center",
        "coordinates": "40.5210907711339, -74.43088704396287"
    },
    {
        "postedAt": "2022-04-29 07:55:18",
        "text": "This was a while back, but to the guy I saw in Starbucks who looked in my direction when I was sitting outside and watching the Rutgers Basketball game (where we got free t-shirts and magnets that day) you were really cute but soooo far away. If you remember me I was the girl wearing the beige pants and jean jacket overcoat :) hmu",
        "campus": "collegeAve",
        "location": "Starbucks",
        "coordinates": "40.4988723,-74.4488872"
    },
    {
        "postedAt": "2022-04-29 13:36:07",
        "text": "to the girl with long brown hair eating plain green beans at neilson at 1:34 pm, will you go to mexico with me? i love you",
        "campus": "cookDoug",
        "location": "Neilson Dining Hall",
        "coordinates": "40.4819303969926, -74.43149637266592"
    },
    {
        "postedAt": "2022-04-29 14:01:49",
        "text": "If your name is Kyle, some girl in the dining hall was talking about you and all I have to say is go for it dude.",
        "campus": "livingston",
        "location": "Livingston Dining Commons",
        "coordinates": "40.522904617015385, -74.43830858842182"
    },
    {
        "postedAt": "2022-04-29 14:06:27",
        "text": "to the blonde guy named jaden i think with a black north face backpack who was on the REXL from red oak lane and got off at livi plaza and went to the starbucks and held the door for me and stood in front of me in line, on friday 4/29 around 1:30 pm, ur MAD fine and i thought u were staring at me so hmu",
        "campus": "livingston",
        "location": "Starbucks",
        "coordinates": "40.7811112,-74.3402897"
    },
    {
        "postedAt": "2022-04-29 14:14:16",
        "text": "I accidentally stole someones black fleece from Heuy’s last night (4/28). It says “State Theater New Jersey” on it. Brand is Crossland. A pink DHC lip cream was found in the pocket. Super sorry! ",
        "campus": "collegeAve",
        "location": "Huey's Knight Club",
        "coordinates": "40.49973754209498, -74.454271900676"
    },
    {
        "postedAt": "2022-04-29 16:23:19",
        "text": "to the white girl with glasses i saw at playa bowls on 4/29 at 4:20… you single?",
        "campus": "collegeAve",
        "location": "Playa Bowls",
        "coordinates": "40.4993556192123, -74.45174665272877"
    },
    {
        "postedAt": "2022-04-29 19:07:56",
        "text": "To the tallish girl (I think maybe blonde) who was working at Jersey Mike’s Friday 4/29 at like 630ish, you made my day and I love your energy. The sub was amazing, keep killin it and I hope to see you again :)",
        "campus": "collegeAve",
        "location": "Jersey Mike's Subs",
        "coordinates": "40.499714115984844, -74.44852983317142"
    },
    {
        "postedAt": "2022-04-29 19:07:47",
        "text": "To the girl on the H bus in the pink formal top plaid pants and air forces. You got off at Busch sc Respectfully you are hot and I’m tryna hit. We made eye contact couple of times. Hmu pls your eyes are so pretty",
        "location": "H Bus"
    },
    {
        "postedAt": "2022-04-29 22:51:19",
        "text": "To the girl named Gauri ur so cool and stylish, I really admire your music taste and your fashion. It’s so pretty and unique!! I see u often in Livi but it’s just so scary to talk to u :/ It’s sad that I am not going to see u often because the semester is ending but if u wanna talk hmu we should atleast be friends:) "
    },
    {
        "postedAt": "2022-04-30 00:52:48",
        "text": "To this guy with a Skatebolt Tornado Pro (I guess) close to Honeygrow  and I said “we (almost) got the same board” hmu so we can ride together sometime",
        "campus": "collegeAve",
        "location": "honeygrow",
        "coordinates": "40.49914114715831, -74.44812038789118"
    },
    {
        "postedAt": "2022-04-30 02:25:21",
        "text": "to the brown boy with glasses, i’m pretty sure ur name is Abhijit, i think i saw you at a party last weekend at PKT & i saw you skateboarding past honeygrow today (4/29) but i just wanted to say ur really cute and if ur single definitely hmu lol ",
        "campus": "collegeAve",
        "location": "honeygrow",
        "coordinates": "40.49914114715831, -74.44812038789118"
    },
    {
        "postedAt": "2022-04-30 12:30:20",
        "text": "Anyone living in Stonier next year? ",
        "campus": "collegeAve",
        "location": "Stonier Hall",
        "coordinates": "40.503176743325426, -74.45122315840494"
    },
    {
        "postedAt": "2022-04-30 17:58:30",
        "text": "Not a missed connections, but if you see people sitting around school buildings trying to do work, please be mindful and not scream at the top of your lungs. We’re trying to get our work done because finals and the last thing I wanna do is know your business."
    },
    {
        "postedAt": "2022-04-30 19:06:18",
        "text": " My friends and I are rising sophomores and we need one more girl for our suite in Judson :))) We all are clean, organized, prioritize school but also like to have fun on the weekends. Please hmu if you are interested !!! @sophiamocci",
        "campus": "busch",
        "location": "Judson Suites",
        "coordinates": "40.52575234249656, -74.45901546920132"
    },
    {
        "postedAt": "2022-04-30 20:48:09",
        "text": "I think I've been in love with a fine man with brown skin and fluffy hair ever since I saw him at the mark conference on the swat team. I think his name is Divon. "
    },
    {
        "postedAt": "2022-04-30 23:07:50",
        "text": "4/30 TO THE BOY WHO WAS HONKING BACK AND FORTH WITH ME PARKED ACROSS FROM ME IN THE YELLOW LOT AT 11:05 pm AND SAID “that shit was funny before” YOU WERE SO GODDAMN FINE CAN I HAVE UR NUMBER ",
        "campus": "livingston",
        "location": "Yellow Lot",
        "coordinates": "40.52778561067915, -74.43823373881361"
    },
    {
        "postedAt": "2022-05-01 01:00:26",
        "text": " April 30th - to the wasian (?) at 41 mine with the yellow hawaiian shirt WE are in love with you. do you wanna homie hop? ",
        "campus": "collegeAve",
        "location": "41 Mine St",
        "coordinates": "40.49989583006359, -74.4514786567805"
    },
    {
        "postedAt": "2022-05-01 13:58:21",
        "text": "asian girl wearing all black with a choker sitting in front of yard bucks near the dog, hi",
        "campus": "collegeAve",
        "location": "Starbucks",
        "coordinates": "40.499256107944916, -74.44827575415016"
    },
    {
        "postedAt": "2022-05-01 14:03:38",
        "text": "not a missed connection, but i'm nonbinary and i want to make more queer friends at rutgers! most of my friends are straight and cis, and i really want to find people like me. if anyone knows good clubs or orgs or anything at all please lmk!"
    },
    {
        "postedAt": "2022-05-01 20:08:44",
        "text": "I was walking down the stairs near Quad 3 around like 6:30. And you were carrying food and had a yellow shirt. You looked up and had pretty eyes and I wanted to turn around and ask you for your name but i got in my own head 🥺. I want to get to know you 😌",
        "campus": "livingston",
        "location": "Quad Three Residence Hall",
        "coordinates": "40.520797088339116, -74.43346971721039"
    },
    {
        "postedAt": "2022-05-01 21:36:25",
        "text": "To Anthony Gaeta in quad 2 ❤️ tysm for telling me i deserved my sexual assault last semester, i literally have not stopped thinking about it. and a big fuck u to all my “friends” who r still friendly with him after i told yall what he said. maybe think about whether its worth sacrificing a friendship to be on good terms with an asshole. also please stop trying to pretend we’re on good terms; i held the door open for u cus im not a bitch not cus i forgave u at all. i literally have never hated anyone in my life but ur the only person who makes me feel disgusted when i look at them.",
        "campus": "livingston",
        "location": "Quad Two Residence",
        "coordinates": "40.51992101760392, -74.43483205063714"
    },
    {
        "postedAt": "2022-05-01 21:41:01",
        "text": "5/1 at 9:30pm at Alex: to the guy talking shit about someone else to your friend on speaker phone, kindly stfu. People are tryna study and get work done",
        "campus": "collegeAve",
        "location": "Alexander Library",
        "coordinates": "40.504984460675374, -74.45257861772129"
    },
    {
        "postedAt": "2022-05-01 22:03:21",
        "text": "To the comp sci guy I’ve been recently hanging out with, I always have a great time when I’m with you. I think you are so charismatic, kind, and intelligent. You make me smile and laugh so hard (even when you are making fun of me). I feel like we really click and I’m so grateful for that. I also have a fat crush on you 🤨🤨🤨"
    },
    {
        "postedAt": "2022-05-01 22:11:49",
        "text": "to the guy who was eating cereal at the busch dining at 9pm last sunday (4/24) and who got on the h bus at around 11.40pm at the casc stop tues the 26th and who i used to see all the time around all four campuses, you’re so cute and give me such good vibes. i hope you have a happy life ☺️.",
        "campus": "busch",
        "location": "Busch Dining Hall",
        "coordinates": "40.522548632995274, -74.45777784367293"
    },
    {
        "postedAt": "2022-05-02 01:34:46",
        "text": "to john that recommended the song virgin veins and duster to me: thanks for the recs. i haven’t been in the best headspace lately so it’s all i’ve been listening to lately :’-) the lyrics got me sobbin lmao"
    },
    {
        "postedAt": "2022-05-02 14:42:05",
        "text": "To the girl at the play boy party wearing the blue play boy crop top and shorts.  You’re gorgeous and curvy Asl  you should hmu "
    },
    {
        "postedAt": "2022-05-02 15:45:03",
        "text": "asian dude on the F bus around 3:10-3:20 with a slightly large rectangular package on the seat next to him. i was the girl with blond hair who sat next to you in the jean jacket and tie dye crocs playing on my switch. you’re cute, if you’re single and see this hmu <3",
        "location": "F bus"
    },
    {
        "postedAt": "2022-05-02 21:07:43",
        "text": "To the dance major with the short curly hair I talked to on the EE around noon today (5/2) you're cute. Keep on dancing!",
        "location": "EE Bus"
    },
    {
        "postedAt": "2022-05-02 21:12:33",
        "text": "Just a reminder to the four remaining HC spoon assassin participants: services will be provided to the winner. Please contact me. Can’t wait to meet up with you!",
        "campus": "collegeAve",
        "location": "Honors College of Rutgers",
        "coordinates": "40.502622481036404, -74.44705358438395"
    },
    {
        "postedAt": "2022-05-02 22:21:23",
        "text": "For the love of god y’all need to get better at listening for numbers at Cafe West. CHECK THE NAME!!! to the dude who screwed me out of my bagel today (5/2) at 10 cmon mannn. That was the last sundried tomato bagel 😭 I tried telling u n you just ignored me 😭😭😭",
        "campus": "collegeAve",
        "location": "Cafe West",
        "coordinates": "40.50155270578214, -74.44820250828582"
    },
    {
        "postedAt": "2022-05-03 09:01:42",
        "text": "If you were on the RexL and got off at Livi plaza, you left your keys on the bus. I tried to take them to the student center but the bus driver wanted to keep them. Hope you find them!",
        "location": "REXL Bus"
    },
    {
        "postedAt": "2022-05-03 09:41:11",  
        "text": "To the white guy in the white shirt who’s the only other person on the LX bus besides me, you’re SUPA cute. U got nice blue eyes and we made eye contact but we both quickly looked away LOL. I wanted to talk to u but there was so much tension with just us being on the bus😭 This is 5/3 at around 9:20AM",
        "location": "LX"
    },
    {
        "postedAt": "2022-05-03 15:02:21",
        "text": "I lost my AirPods in pink case near the yard and it would be really helpful if anyone has any information regarding it.",
        "campus": "collegeAve",
        "location": "The Yard",
        "coordinates": "40.49939315941969, -74.44850512044424"
    },
    {
        "postedAt": "2022-05-03 16:41:18",
        "text": "HEY THERE WAS A GIRL WHO WORKS AT NEILSON DINING HALL WHO LOOKS LIKE DIXIE D’AMELIO IF ANYONE KNOWS HER LET ME KNOW",
        "campus": "cookDoug",
        "location": "Neilson Dining Hall",
        "coordinates": "40.48185706492709, -74.43148565193232"
    },
    {
        "postedAt": "2022-05-04 01:53:58",
        "text": "To the two girls who came up to me and my friend in front of socam tonight with that creepy guy making really weird comments and not leaving us alone, thank u guys 😭 even u just asking if we were waiting for a bus helped get me to muster up the courage to just tell him to straight up get out of here. love u queens ❤️❤️",
        "campus": "collegeAve",
        "location": "SoCam 290 Apartments",
        "coordinates": "40.49171454117129, -74.44347969235689"
    },
    {
        "postedAt": "2022-05-04 11:08:10",
        "text": "To the girl at Huey’s on May 3 who told me she was from Los Angeles. You were super cute and should hmu. ",
        "campus": "collegeAve",
        "location": "Huey's Knight Club",
        "coordinates": "40.4997596086294, -74.45427183512203"
    },
    {
        "postedAt": "2022-05-04 11:08:34",
        "text": "To one of cowboys in Huey’s, I don’t think you are 💅🏽, but respectfully you are fine af. I borrowed your hat last night and took a picture with, if you are 💅🏽 or curious hmu 🫣",
        "campus": "collegeAve",
        "location": "Huey's Knight Club",
        "coordinates": "40.4997596086294, -74.45427183512203"
    },
    

    {
        "postedAt": "2022-05-04 15:18:31",
        "text": "Yo to the dude that complimented my zyzz shirt around 3 at livi plaza on may 4 i rlly appreciate it that made my whole day. hmu if you wanna take pre blast hardstyle and get a workout in sometime💪",
        "campus": "livingston",
        "location": "Livingston Plaza",
        "coordinates": "40.52563577432371, -74.43858326557064"
    },
    {
        "postedAt": "2022-05-04 15:18:35",
        "text": "(5/4) to the Asian girl at werblin who was wearing a green top, black gymshark leggings and bred yeezys. if you’re single hmu bc damn you really caught my eye",
        "campus": "busch",
        "location": "Sonny Werblin Recreation Center",
        "coordinates": "40.519577493314834, -74.46084178303502"
    },
    {
        "postedAt": "2022-05-04 16:07:06",
        "text": "To the guy that I met at Rutgers Day. We were sitting in the back of the bus from Busch to Cook/Doug together. We were talking about you didn’t get anything from the tables so I gave you one of my highlighters, I should’ve gotten your snap because I thought you were really cute. ",
        "location": "REXB Bus"
    },
    {
        "postedAt": "2022-05-04 17:18:58",
        "text": "To the brown girl whom I saw on 2nd May at the Busch gym around 5-6pm. Whom I gave compliment . I really found you cute and attractive. Would love to get you know more . HMU I was the guy in long sleeve wearing green . ",
        "campus": "busch",
        "location": "Sonny Werblin Recreation Center",
        "coordinates": "40.519577493314834, -74.46084178303502"
    },
    {
        "postedAt": "2022-05-04 18:02:10",
        "text": "Please does anyone know if Doug cafe burrito boy is single. He held my gaze for like .5 seconds today and I melted. I’m so down bad for him. Please. ",
        "campus": "cookDoug",
        "location": "Dougless Cafe",
        "coordinates": "40.48481983118934, -74.43668808665862"
    },
    {
        "postedAt": "2022-05-04 18:36:06",
        "text": "To the people who were making farting noises at the midnight breakfast at Neilson and being hella disrespectful to ur surroundings while people were trying to eat. U guys were actual dickheads.",
        "campus": "cookDoug",
        "location": "Neilson Dining Hall",
        "coordinates": "40.48185706492709, -74.43148565193232"
    },
    {
        "postedAt": "2022-05-04 23:56:19",
        "text": "To the tall guy with the long hair and red baseball cap who’s always studying in the cafe seating portion of the Doug student center until it closes at 11:30pm, I’ve always wondered what your major is. You seem so hardworking. Best of luck on your finals! ",
        "campus": "cookDoug",
        "location": "Douglass Student Center",
        "coordinates": "40.4847874387813, -74.43661305360841"
    },
    {
        "postedAt": "2022-05-05 02:52:47",
        "text": "To the guy in the fraternity behind my apartment who listened to me when I asked to turn down the music , you’re cute hmu"
    },
    {
        "postedAt": "2022-05-05 04:22:33",
        "text": "The girl studying for some ECE final at 4 am on 5/5 at the 1st floor of best north, u seem cool. Honestly didn’t say anything because I’m a bitch but after finals, u tryna go out?",
        "campus": "busch",
        "location": "BEST North",
        "coordinates": "40.52196937567454, -74.45542650942794"
    },
    {
        "postedAt": "2022-05-05 11:08:41",
        "text": "this is kind of a while ago but to kevin w a mullet  playing volleyball at werb with me and my friend i thought you were pretty cute and nice but i left before getting your socials :( ",
        "campus": "busch",
        "location": "Sonny Werblin Recreation Center",
        "coordinates": "40.519542138214476, -74.46090893133326"
    },
    {
        "postedAt": "2022-05-05 17:49:59",
        "text": "girl at the bsc by the cafe on 5/5 around 5:45 - loved your outfit and the rainbow patch on your jeans! ",
        "campus": "busch",
        "location": "Busch Student Center",
        "coordinates": "40.52331990140866, -74.4581855405819"
    },
    {
        "postedAt": "2022-05-05 18:51:54",
        "text": "To the girl in blue shorts who looked back at me while leaving cook gym, i was wearing a black tank, hmu, we should hit the gym sometime 🤙🏼",
        "campus": "cookDoug",
        "location": "Cook/Douglass Recreation Center",
        "coordinates": "40.47863464896412, -74.43264348258762"
    },
    {
        "postedAt": "2022-05-05 19:17:14",
        "text": "to my “friends” who have no problem asking me to help do your work and then promise to help with mine and then conveniently bail when it comes time to help me, thanks so much, you really are great friends "
    },
    {
        "postedAt": "2022-05-05 20:50:19",
        "text": "To the girl with the nose piercing that works at mamouns falafel I was there at like 7pm, you really caught my eye I would love to get to know you  ",
        "campus": "collegeAve",
        "location": "Mamoun's Falafel",
        "coordinates": "40.49774479996368, -74.4490292715377"
    },
    {
        "postedAt": "2022-05-05 21:01:34",
        "text": "to the guy with the blue shirt and long-ish hair who was kinda flirting with me a tiny bit before the precalc 2 exam in the gym from 4-7, i know i’ll probably never see you again but i thought you were really cute and kinda looked like Chase Stokes. just cut the hair please, short hair would suit you ",
        "campus": "livingston",
        "location": "Livingston Recreation Center",
        "coordinates": "40.52120495107628, -74.43089776929375"
    },
    {
        "postedAt": "2022-05-05 21:25:12",
        "text": "This to the girl that work in Tacoria that served me and my friend on Rutgers Day. You had the purple highlights on your hair. You are so fine. If you single, so am I.",
        "campus": "collegeAve",
        "location": "tacoria",
        "coordinates": "40.49768052547864, -74.44897554552139"
    },
    {
        "postedAt": "2022-05-05 21:29:00",
        "text": "Shoutout to the random girl that wiped the icing out of my beard at CLAC during Rutgers Day! 😂 "
    },

    {
        "postedAt": "2022-05-06 13:21:26",
        "text": "To the two girls that were barking in the parking lot on Livi that was the funniest thing ever and I’m still convinced you were not sober"
    },
    {
        "postedAt": "2022-05-06 13:22:48",
        "text": "To the two girls crying holding a tissue box in the LSC around 9 pm on May 6th keep smiling it’ll get better ",
        "campus": "livingston",
        "location": "Livingston Student Center",
        "coordinates": "40.52358674485989, -74.43718383828255"
    },
    {
        "postedAt": "2022-05-06 16:50:53",
        "text": "05/06 to the white girl with the teddy bear jacket that was with her friend with the sky blue hoodie: if you drop your package of strawberries at the Academic Building on CA clean it up. You literally walked into Cafe west to get new utensils, it’s not that hard to grab a few tissues to clean up your mess before leaving. Your first intention should be to clean the mess up not posting your accident on snapchat or wherever. Be respectful to the workers and the people you share the space with.",
        "campus": "collegeAve",
        "location": "Rutgers Academic Building",
        "coordinates": "40.5016946591156, -74.44813835788067"
    },
    {
        "postedAt": "2022-05-06 18:03:57",
        "text": "To the people on the second floor of Perry Hall cheering for my boyfriend and I to kiss outside in the rain, it made me laugh and I appreciated it lmao",
        "campus": "cookDoug",
        "location": "Perry Residence Hall",
        "coordinates": "40.47702964893622, -74.43373242903743"
    },
    {
        "postedAt": "2022-05-06 21:12:47",
        "text": "I know this is kinda late, but to the guy in my Mon/Wed calc class with Banerjee who sat directly in front of me and kept glancing back at me/in my direction during class for the last few weeks now: if by some off chance you’re 💅, HMU"
    },
    {
        "postedAt": "2022-05-06 22:25:00",
        "text": "To the girl that I’ve seen every Wednesday this semester and our only interactions were after a midterm, exchanging hi/byes, and a birthday wish, you made me look forward to every Wednesday :). Hopefully we have a class together next semester and I have the courage to start an actual conversation. ps: hope you did well on your final today 5/6"
    },
    {
        "postedAt": "2022-05-07 13:15:04",
        "text": "Omg to Anna that lives in the Thomas Suites(? I think that’s what you said) thank you for sharing your umbrella with me back to McCormick, that was super sweet and it made my day! 🥰🥰🥰",
        "campus": "busch",
        "location": "Thomas Suites Residence Hall",
        "coordinates": "40.525136909966626, -74.45947941058674"
    },
    {
        "postedAt": "2022-05-07 13:58:24",
        "text": "to whoever stole my bagel from the toaster at bdh on may 7 around 2, we have a problem ",
        "campus": "busch",
        "location": "Busch Dining Hall",
        "coordinates": "40.522548632995274, -74.45777784367293"
    },
    {
        "postedAt": "2022-05-07 23:32:33",
        "text": "To the girl wearing the Miami Heat Wade sweatshirt at 16 handles in 5/7 at 9:30pm, I think you are super cute. I see you around campus often and I hope one day we can meet and hangout. :)",
        "campus": "livingston",
        "location": "16 Handles",
        "coordinates": "40.525596272501836, -74.43769556906288"
    },
    {
        "postedAt": "2022-05-08 17:01:54",
        "text": "5/08 (Sunday)-to the girl at the busch student center around 5 pm taking a printout wearing a grey hoodie and black-grey leggings, i think you’re really very beautiful:) you’re one of the prettiest women i’ve ever seen!! i’d love to get to know you;)",
        "campus": "busch",
        "location": "Busch Student Center",
        "coordinates": "40.52331990140866, -74.4581855405819"
    },
    {
        "postedAt": "2022-05-08 20:06:24",
        "text": "Not a missed connection but just wanted to know if anyone would like to be friends with me. I've had a pretty crappy semester during the last couple weeks of school and just want to surround myself with more friends. I'm an Indian who loves trying new food, watching anime, recording YouTube videos, and coming up with song lyrics for my channel! I also want to become a professional performer someday and am currently a Psych Major with a minor in Education. Lmk if you're down to be friends lol!"
    },
    {
        "postedAt": "2022-05-09 13:51:51",
        "text": "To the person crying in the meeting room in Tillet computer lab on 5/9 .. i hope u feel better !! :( ",
        "campus": "livingston",
        "location": "Tillet Hall",
        "coordinates": "40.5219585039965, -74.43602188478512"
    },
    {
        "postedAt": "2022-05-09 14:29:35",
        "text": "5/9: To Parth and Jay Vee (hope I spelt your names right lol), that I met after my chem final at the Livi Gym, that volleyball game was a load of fun, and really made my day, hope y’all have a great summer if I don’t see you guys <3! Hmu on insta since it was a lot of fun playing with you guys :)",
        "campus": "livingston",
        "location": "Livingston Recreation Center",
        "coordinates": "40.52120495107628, -74.43089776929375"
    },
    {
        "postedAt": "2022-05-09 21:14:08",
        "text": "To the person with blonde hair, a green shirt, blue jeans, and red docs waiting at the light across the street from the douglass student center on may 9, we kept making eye contact and i wanted to talk to you but i was with two of my friends and i couldn’t leave them. If you see this, I would love to talk to you and get to know you :) ",
        "campus": "cookDoug",
        "location": "Douglass Student Center",
        "coordinates": "40.484746639930535, -74.43670961483221"
    },
    {
        "postedAt": "2022-05-10 04:08:25",
        "text": "5/9 - the girl at the front desk in college ave student center with blonde hair and blue eyes. I’d like to get to know you. I was the asian kid with highlights and wearing pink pants that u said good afternoon to, twice :)",
        "campus": "collegeAve",
        "location": "College Avenue Student Center",
        "coordinates": "40.50288142637295, -74.45203002306403"
    },
    {
        "postedAt": "2022-05-10 10:22:11",
        "text": "The two people behind me on the H bus who are arguing over whether grammar is an arbitrary set of rules or like art, holy shit your minds. I didn't want to intrude but I had so many thoughts on your conversation. Please hang out with me, y'all seemed so cool",
        "location": "H Bus"
    },
    {
        "postedAt": "2022-05-10 12:55:07",
        "text": "5/9. Latina girl who got on the EE at around 5:50-6 pm with the white tank top, tattoo on left shoulder, and wearing flip flops. You fine as hell",
        "location": "EE Bus"
    },
    {
        "postedAt": "2022-05-10 19:14:29",
        "text": "To the girl I lended my pencil to during calc 151 final at ARC, you think I could get it back or naw ",
        "campus": "busch",
        "location": "Allison Road Classroom",
        "coordinates": "40.5238678102084, -74.46524115465765"
    },
    {
        "postedAt": "2022-05-11 01:07:55",
        "text": "5/10-  to the guy on the H bus around 10 pm who was doing his hw and asked me about the feather tattoo, sorry I wasn’t able to talk to u- my stop came and my friend dragged me out of the bus. I wish I got ur name!!!",
        "location": "H Bus"
    },
    {
        "postedAt": "2022-05-11 01:17:43",
        "text": "to the cashier who was wearing glasses at el jefe’s in college ave on 5/10 around 9pm, I was the short girl with curly hair who ordered a bowl with my 2 friends. wish I got ur insta !! ",
        "campus": "collegeAve",
        "location": "El Jefe's Taqueria",
        "coordinates": "40.49902968227487, -74.44837546916641"
    },
    {
        "postedAt": "2022-05-11 11:52:10",
        "text": "Crystal in the business school (5/11), thank you so much for buying me that monster. I stayed up all night for a final and you are too good for this world for doing that for a stranger. Please let me venmo you or return the favor sometime! :)",
        "campus": "livingston",
        "location": "Rutgers Business School",
        "coordinates": "40.523787581528005, -74.44060511200078"
    },
    {
        "postedAt": "2022-05-11 19:21:19",
        "text": "5/11. I’ve been meaning to say this for a while now, but to the girl who was at kilmer’s at around 4:30 with black leggings and ugg slippers, let’s get coffee.   ",
        "campus": "livingston",
        "location": "Kilmer's Market",
        "coordinates": "40.52576372455097, -74.43879895708778"
    },
    {
        "postedAt": "2022-05-11 20:29:58",
        "text": "To the tall white boy at cook douglass gym who's usually wearing Adidas, a mask and headband/bandana, I think you're really cute. I saw you on Monday wearing a shirt that said Emory Elite or something but I was too nervous to talk to you bc I was with my friend. One time you helped me put weights on the bar to squat and I was confused as to what you were doing so maybe I scared you off with my rbf. I'm the Asian girl with reddish hair at cook doug gym who prob looks mad usually. Hit me up if you'd wanna hang out sometime :)",
        "campus": "cookDoug",
        "location": "Cook/Douglass Recreation Center",
        "coordinates": "40.47872453282531, -74.43268639587222"
    },
    {
        "postedAt": "2022-05-12 01:09:01",
        "text": "To the tall brown guy RA at BEST East who’s a CS major, I met you the first week of fall sem and saw you today when moving out. I didn’t realize you were cute lol, I wish I saw you more ",
        "campus": "busch",
        "location": "BEST East",
        "coordinates": "40.52190034094479, -74.45481793022138"
    },
    {
        "postedAt": "2022-05-12 02:11:28",
        "text": "To the guy who gave me the free vanilla ice cream on 5/11 at surreal, thank you so much! You really made my night and it was so sweet, I was gonna ask for your name but I got shy. I like your hair thank you for the sprinkles too :)",
        "campus": "collegeAve",
        "location": "Surreal Creamery",
        "coordinates": "40.49690649572787, -74.44720722412544"
    },
    {
        "postedAt": "2022-05-12 09:36:33",
        "text": "to the girl wearing green leggings and grey top at werblin (around 2pm), i thought you were really fine. if you’re single hit me uppp",
        "campus": "busch",
        "location": "Sonny Werblin Recreation Center",
        "coordinates": "40.519542138214476, -74.46090893133326"
    },
    {
        "postedAt": "2022-05-12 13:09:39",
        "text": "To the super tall girl Lola… you are literally the girl of my dreams 😳"
    }
]
